# include <stdio.h>

int main(void)
{
	int a[7] = {1, 2, 3, 4, 5, 6, 7};
	int i = 0;
	int k = 6;
	int t;
	
	while(i<k)
	{
		t = a[i];
		a[i] = a [k];    //注意这里的小技巧，将1与7换，2与6换，保证对称的这样换就可以将数字倒过来 
		a[k] = t;         //交换时注意利用两个变量ik，17交换完后一个加一，一个减一就可以继续将26交换 
		i++;            //第12-14行就是要背下来的东西了 
		k--;
	}
	
    for(i = 0; i<7; i++)           //小技巧之输出：需要输出多个变量时，利用for循环，这样就不用连续打7次printf了 
        printf("%d", a[i]);        //平时要输出多个变量的时候，也尽量写成a1a2这样，不要写成abcd，这样就可以利用for循环更方便输出a1a2 
	
	return 0;
}
